{
	"@metadata": {
		"authors": [
			"Ryan Schmidt"
		]
	},
	"apihelp-query+redirects-param-mirror": "Include mirrored redirects in the results. Ignored when this module is used as a generator.",
	"fork": "Fork page",
	"mirror": "Mirror page",
	"logentry-delete-fork": "$1 {{GENDER:$2|deleted}} mirrored page $3",
	"logentry-delete-mirror": "$1 {{GENDER:$2|restored}} mirrored page $3",
	"logentry-import-fork": "$1 {{GENDER:$2|imported}} mirrored page $3 from $4",
	"right-fork": "Create local copies of mirrored pages",
	"wikimirror-action-fork": "Fork",
	"wikimirror-action-mirror": "Mirror",
	"wikimirror-api-error": "An unrecoverable error has occurred with the remote wiki's API.",
	"wikimirror-config-assignknownusers": "When forking pages, whether or not imported revisions will be assigned to local users should their username match",
	"wikimirror-config-cachedirectory": "Path to local cache of mirrored page HTML and wikitext, in Wikimedia Enterprise API JSON format",
	"wikimirror-config-remote": "Interwiki prefix of the remote wiki",
	"wikimirror-config-searchmaxresults": "When performing a search against the mirrored site, the maximum number of results to fetch",
	"wikimirror-delete-success": "The mirrored page \"$1\" has been deleted and may now be created locally. See $2 for a record of recent deletions.",
	"wikimirror-desc": "Mirror and fork remote wiki articles",
	"wikimirror-extensionname": "WikiMirror",
	"wikimirror-fork-comment": "Comment:",
	"wikimirror-fork-import": "Import revisions",
	"wikimirror-fork-text": "Forking this page will stop mirroring it from the remote wiki, allowing you to edit it locally. If you choose to import revisions, all revisions of the page will be imported from the remote wiki; the current revision will be imported immediately and the remainder will slowly be imported over time.\n\nTemplates and images used on the page will '''not''' be imported. If the template or image already exists locally, those local versions will be used by the forked page. Otherwise, it will continue to use versions of those templates and images from the remote wiki.",
	"wikimirror-fork-title": "Fork $1",
	"wikimirror-import-success": "The most recent revision of [[$1]] has been successfully imported. Older revisions are scheduled to be imported; please be patient.",
	"wikimirror-mirror-history": "This page is being mirrored from another wiki. [$1 Click here to view the page history on the remote wiki.]",
	"wikimirror-mirror-success": "[[$1]] is now being mirrored.",
	"wikimirror-mirror-text": "Restoring mirroring to this page will result it it pulling its content from the remote wiki once again. Transclusions will also make use of the mirrored content. Deleted local revisions of the page will no longer be accessible while the page is mirrored.",
	"wikimirror-mirror-title": "Mirror $1",
	"wikimirror-mirrored": "This page is being mirrored from another wiki. Click here to view the remote page.",
	"wikimirror-no-action": "You may not perform this action on a mirrored page.",
	"wikimirror-no-edit": "You may not edit a mirrored page; it must be forked first.",
	"wikimirror-no-mirror": "Unable to mirror $1. It may not exist on the remote wiki or may be a sensitive page.",
	"wikimirror-nofork-text": "The specified page cannot be forked. It may already exist locally or it may not exist remotely.",
	"wikimirror-nofork-title": "Cannot fork",
	"wikimirror-nomirror-text": "The specified page cannot be mirrored. It must have been previously forked and subsequently deleted.",
	"wikimirror-nomirror-title": "Cannot mirror"
}
