{
	"@metadata": {
		"authors": [
			"Ryan Schmidt"
		]
	},
	"apihelp-query+redirects-param-mirror": "Help displayed in the API for the rdmirror parameter",
	"fork": "Form heading for Special:Fork, also used as button text on Special:Fork.",
	"logentry-delete-fork": "Log entry used when forking a page without importing revisions; this effectively deletes the page locally.",
	"logentry-delete-mirror": "Log entry used when restoring mirroring to a page that has been deleted locally.",
	"logentry-import-fork": "Log entry used when forking a page and importing remote revisions.",
	"mirror": "Form heading for Special:Mirror, also used as the button text on Special:Mirror.",
	"right-fork": "{{doc-right|fork}}",
	"wikimirror-action-fork": "Text displayed in the tab which allows users to make a local copy of a mirrored page for editing.",
	"wikimirror-action-mirror": "Text displayed in the navigation menu which allows users to restore the mirrored version of a page.",
	"wikimirror-api-error": "{{optional}} Error message added to server logs when an error is encountered. This message is not exposed to users.",
	"wikimirror-config-assignknownusers": "{{optional}} Description of the configuration variable $wgWikiMirrorAssignKnownUsers. This message is not exposed to users.",
	"wikimirror-config-cachedirectory": "{{optional}} Description of the configuration variable $wgWikiMirrorCacheDirectory. This message is not exposed to users.",
	"wikimirror-config-remote": "{{optional}} Description of the configuration variable $wgWikiMirrorRemote. This message is not exposed to users.",
	"wikimirror-config-searchmaxresults": "{{optional}} Description of the configuration variable $wgWikiMirrorSearchMaxResults. This message is not exposed to users.",
	"wikimirror-delete-success": "Success message displayed when a page is forked without importing any revisions.",
	"wikimirror-desc": "{{desc|name=WikiMirror|url=https://www.mediawiki.org/wiki/Extension:WikiMirror}}",
	"wikimirror-extensionname": "{{name}}",
	"wikimirror-fork-comment": "Comment:",
	"wikimirror-fork-import": "Checkbox label on Special:Fork",
	"wikimirror-fork-text": "Help text displayed on Special:Fork.",
	"wikimirror-fork-title": "Header displayed on Special:Fork, $1 is the title of the page being forked.",
	"wikimirror-import-success": "Success message displayed when a page is forked and revisions were imported.",
	"wikimirror-mirror-history": "Message displayed when a user visits the history page of a mirrored page. $1 is the URL of the remote wiki's history page.",
	"wikimirror-mirror-success": "Success message displayed when a page is mirrored.",
	"wikimirror-mirror-text": "Help text displayed on Special:Mirror.",
	"wikimirror-mirror-title": "Header displayed on Special:Mirror, $1 is the title of the page being mirrored.",
	"wikimirror-mirrored": "Hover text for the icon displayed at the top right of mirrored pages. Clicking the icon takes the user to the remote site.",
	"wikimirror-no-action": "Message displayed to users when they attempt to perform a disallowed action with a mirrored page, such as protection or moving.",
	"wikimirror-no-edit": "Message displayed to users when they click View Source to view the wikitext of a mirrored page.",
	"wikimirror-no-mirror": "{{optional}} Error message added to server logs when an error is encountered. This message is not exposed to users. $1 is the name of the page.",
	"wikimirror-nofork-text": "Error message displayed when the page cannot be forked.",
	"wikimirror-nofork-title": "Header displayed when the page cannot be forked.",
	"wikimirror-nomirror-text": "Error message displayed when the page cannot be mirrored.",
	"wikimirror-nomirror-title": "Header displayed when the page cannot be mirrored."
}
